## How to Run sqlite commands using python

Steps to work with sqlite3 in python :
1. Import Module :
    
    `import sqlite3`
    
    
2. Create connection with database : 
    
    `connection=sqlite3.connect('database_name')`
    
    
3. check connection status :

    `print(connection.total_changes)`
    
    
4. Create cursor object :

    `c=connection.cursor()`
    
    To execute commands `c.execute()` and `c.fetchall()`.

## Import Library & Create database connection

In [1]:
import sqlite3
conn = sqlite3.connect('Db-IMDB.db')
cursor = conn.cursor()
print("Opened database successfully")

Opened database successfully

In [2]:
print(conn.total_changes)

0

## Read Tables from the databse

In [3]:
# Read tables and columns
tableList = []
for table in cursor.execute("select name from sqlite_master where type = 'table';"):
    tableList.append(table[0])

In [4]:
tableList

['Movie',
 'Genre',
 'Language',
 'Country',
 'Location',
 'M_Location',
 'M_Country',
 'M_Language',
 'M_Genre',
 'Person',
 'M_Producer',
 'M_Director',
 'M_Cast']

### Table info

In [6]:
for columns in cursor.execute("PRAGMA table_info(Person);"):
        print(columns)

(0, 'index', 'INTEGER', 0, None, 0)
(1, 'PID', 'TEXT', 0, None, 0)
(2, 'Name', 'TEXT', 0, None, 0)
(3, 'Gender', 'TEXT', 0, None, 0)

## Select Query

In [7]:
cursor.execute("SELECT * FROM MOVIE LIMIT 10;")

In [8]:
for row in cursor.execute("SELECT * FROM MOVIE LIMIT 10;"):
    print(row)

(0, 'tt2388771', 'Mowgli', '2018', 6.6, 21967)
(1, 'tt5164214', "Ocean's Eight", '2018', 6.2, 110861)
(2, 'tt1365519', 'Tomb Raider', '2018', 6.4, 142585)
(3, 'tt0848228', 'The Avengers', '2012', 8.1, 1137529)
(4, 'tt8239946', 'Tumbbad', '2018', 8.5, 7483)
(5, 'tt7027278', 'Kedarnath', '2018', 5.5, 1970)
(6, 'tt3498820', 'Captain America: Civil War', '2016', 7.8, 536641)
(7, 'tt8108198', 'Andhadhun', '2018', 9.0, 18160)
(8, 'tt3741834', 'Lion', '2016', 8.1, 170216)
(9, 'tt6747420', 'Rajma Chawal', '2018', 5.7, 681)

In [9]:
for row in cursor.execute("SELECT * FROM Person LIMIT 10;"):
    print(row)

(0, 'nm0000288', ' Christian Bale', 'Male')
(1, 'nm0000949', ' Cate Blanchett', 'Female')
(2, 'nm1212722', ' Benedict Cumberbatch', 'Male')
(3, 'nm0365140', ' Naomie Harris', 'Female')
(4, 'nm0785227', ' Andy Serkis', 'Male')
(5, 'nm0611932', ' Peter Mullan', 'Male')
(6, 'nm2930503', ' Jack Reynor', 'Male')
(7, 'nm0550371', ' Eddie Marsan', 'Male')
(8, 'nm0390903', ' Tom Hollander', 'Male')
(9, 'nm0722629', ' Matthew Rhys', 'Male')

In [10]:
list(cursor.execute("SELECT * FROM MOVIE LIMIT 10;"))

[(0, 'tt2388771', 'Mowgli', '2018', 6.6, 21967),
 (1, 'tt5164214', "Ocean's Eight", '2018', 6.2, 110861),
 (2, 'tt1365519', 'Tomb Raider', '2018', 6.4, 142585),
 (3, 'tt0848228', 'The Avengers', '2012', 8.1, 1137529),
 (4, 'tt8239946', 'Tumbbad', '2018', 8.5, 7483),
 (5, 'tt7027278', 'Kedarnath', '2018', 5.5, 1970),
 (6, 'tt3498820', 'Captain America: Civil War', '2016', 7.8, 536641),
 (7, 'tt8108198', 'Andhadhun', '2018', 9.0, 18160),
 (8, 'tt3741834', 'Lion', '2016', 8.1, 170216),
 (9, 'tt6747420', 'Rajma Chawal', '2018', 5.7, 681)]

## Question 1 :

List the names of all the `actors` who played in the movie **Anand (1971)**

In [11]:
sql_query2 = """
SELECT DISTINCT TRIM(Name) FROM Person WHERE PID IN (
SELECT DISTINCT TRIM(PID) FROM M_Cast WHERE MID = (
SELECT TRIM(MID) FROM Movie M WHERE TRIM(M.title) = 'Anand')) ;
"""
for row in cursor.execute(sql_query2):
    print(row)

('Amitabh Bachchan',)
('Rajesh Khanna',)
('Sumita Sanyal',)
('Ramesh Deo',)
('Seema Deo',)
('Asit Kumar Sen',)
('Dev Kishan',)
('Atam Prakash',)
('Lalita Kumari',)
('Savita',)
('Brahm Bhardwaj',)
('Gurnam Singh',)
('Lalita Pawar',)
('Durga Khote',)
('Dara Singh',)
('Johnny Walker',)
('Moolchand',)

## Question 2 :

List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return `director name`, the `movie name`, and the `year`.

In [ ]:
sql_query1 = """
SELECT DISTINCT TRIM(Name),TRIM(title),TRIM(year) 
FROM Movie M JOIN M_Director D ON M.MID = D.MID 
JOIN Person P ON P.PID = D.PID
JOIN (SELECT MID,GID FROM M_Genre 
WHERE GID IN (SELECT GID FROM Genre WHERE Name LIKE '%Comedy%')) AS G ON G.MID = M.MID
WHERE (CAST(year AS int) % 400) OR (CAST(year AS int) % 4 AND NOT CAST(year AS int) % 100) ;
"""


for row in cursor.execute(sql_query1):
    print(row)

### Solution 2 :

## Question 3 :

List all the actors who acted in a film before 1970 and in a film after 1990. 
(That is: < 1970 and > 1990.)

### Solution 3 :

In [ ]:

sql_query3= """
SELECT DISTINCT TRIM(Name) FROM Person WHERE PID IN (
SELECT DISTINCT TRIM(PID) FROM M_Cast WHERE MID IN (
SELECT TRIM(MID) FROM Movie WHERE year<1970 )
INTERSECT 
SELECT DISTINCT TRIM(PID) FROM M_Cast WHERE MID IN (
SELECT TRIM(MID) FROM Movie WHERE year>1990 )
)
"""
for row in cursor.execute(sql_query3):
    print(row)

## Question 4 :

List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the `directors' names` and the `number of movies each of them directed`.

### Solution 4 :

In [ ]:
sql_query4 = """
SELECT DISTINCT TRIM(P.Name), MC.M_Count FROM Person P JOIN (
SELECT TRIM(PID) As PID,COUNT(MID) AS M_Count FROM M_Director 
GROUP BY PID HAVING COUNT(MID)>=10 ) AS MC ON MC.PID = P.PID
ORDER BY MC.M_Count DESC
"""
for row in cursor.execute(sql_query4):
    print(row)

## Question 5 :

a. For each year, count the number of movies in that year that had only female actors. we will do this by negation method, that is to find all movies where there is any male actor and exclude those movie Id's. We'll then group by year


b. Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

### Solution 5 a

In [ ]:
# Q5 a.

sql_query5a = """
SELECT year,COUNT(MID) FROM Movie WHERE TRIM(MID) NOT IN (
SELECT DISTINCT TRIM(C.MID) FROM M_Cast C JOIN Person P ON TRIM(C.PID)=TRIM(P.PID)
WHERE TRIM(P.Gender) = 'Male') GROUP BY year;
"""
for row in cursor.execute(sql_query5a):
    print(row)

### Solution 5 b

In [ ]:
# Q5 b.

sql_query5b = """
SELECT FMovies.year,FMovies.Count,(FMovies.Count*100.0)/COUNT(TRIM(MID)) FROM Movie M JOIN (
SELECT year,COUNT(TRIM(MID)) as Count FROM Movie WHERE TRIM(MID) NOT IN (
SELECT DISTINCT TRIM(C.MID) FROM M_Cast C JOIN Person P ON TRIM(C.PID)=TRIM(P.PID)
WHERE TRIM(P.Gender) = 'Male') GROUP BY year  ) AS FMovies ON M.year=FMovies.year
GROUP BY FMovies.year 
"""
for row in cursor.execute(sql_query5b):
    print(row)

## Question 6 :

Find the film(s) with the largest cast. Return the `movie title` and the `size of the cast`. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

### Solution 6 :

In [ ]:

sql_query6 = """
SELECT title,COUNT(DISTINCT PID) AS Ncast FROM Movie M JOIN M_Cast C ON 
TRIM(M.MID)=TRIM(C.MID)
GROUP BY M.MID HAVING Ncast = ( SELECT MAX(NC.PCount) FROM 
                       (SELECT COUNT(DISTINCT PID) AS PCount 
                        FROM M_Cast GROUP BY MID) NC)
"""
for row in cursor.execute(sql_query6):
    print(row)

## Question 7 :

A decade is a sequence of 10 consecutive years. For example, say in your database you have movie information starting from 1965. Then the first decade is 1965,1966, ..., 1974; the second one is 1967, 1968, ..., 1976 and so on. Find the decade D with the largest number of films and the total number of films in D. In our data the year ranges from 1931 - 2018 Given any year we can find the decade by the formula: `decade = year - (year%10)`

### Solution 7 :

In [ ]:

sql_query7 = """
SELECT year-year%10 As Decade, COUNT(DISTINCT MID) as NumM
FROM Movie
WHERE LENGTH(year)=4 
GROUP BY Decade
ORDER BY NumM DESC LIMIT 1
"""
for row in cursor.execute(sql_query7):
    print(row)

## Question 8 :

Find the actors that were never unemployed for more than 3 years at a stretch. (Assume that the actors remain unemployed between two consecutive movies).

### Solution 8 :

In [ ]:

sql_query8 = """
WITH Movie_Year AS (
    SELECT DISTINCT TRIM(MC.PID) AS PID, TRIM(M.Year) AS YEAR, 
    ROW_NUMBER() OVER (PARTITION BY TRIM(MC.PID) ORDER BY Year) Row_Num 
    FROM Movie M JOIN M_Cast MC ON TRIM(M.MID)=TRIM(MC.MID) 
     )

SELECT DISTINCT Name FROM Person WHERE PID NOT IN (
SELECT DISTINCT M1.PID FROM Movie_Year M1 JOIN Movie_Year M2 
ON M1.PID=M2.PID AND M1.Row_Num+1=M2.Row_Num
WHERE M2.Year-M1.Year >= 3  )
"""
for row in cursor.execute(sql_query8):
    print(row)

## Question 9 :

Find all the actors that made more movies with Yash Chopra than any other director. For this we create a temporary table with data as Cast, Favourite Director, and Num of movies made together. Then we filter this table for Director Yash Chopra and print the actors

### solution 9 :

In [ ]:

sql_query9 = """
WITH Cast_Fav_Dir AS (
SELECT CID, DID, Num_Movies,
ROW_NUMBER() OVER( PARTITION BY CID ORDER BY Num_Movies DESC) Row_Num FROM (
SELECT TRIM(C.PID) AS CID,TRIM(D.PID) AS DID,COUNT(DISTINCT TRIM(C.MID)) AS Num_Movies 
FROM M_Cast C JOIN M_Director D ON TRIM(C.MID)=TRIM(D.MID)
GROUP BY TRIM(C.PID),TRIM(D.PID)) AS TEMP     )

SELECT DISTINCT TRIM(Name) FROM Person WHERE PID IN (
SELECT DISTINCT CID FROM Cast_Fav_Dir AS FD WHERE Row_Num = 1
AND DID IN (SELECT DISTINCT TRIM(PID) FROM Person WHERE NAME LIKE '%YASH%CHOPRA%' ))
"""

for row in cursor.execute(sql_querytest):
    print(row)

## Question 10 

The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

### Solution 10

In [ ]:
# For this we find SRK number 0+1+2 and remove SRK number 0+1
sql_query10 = """
SELECT DISTINCT TRIM(Name) FROM Person WHERE PID IN (
SELECT DISTINCT TRIM(PID) AS PID FROM M_Cast WHERE TRIM(MID) IN (
SELECT DISTINCT TRIM(MID) FROM M_Cast WHERE TRIM(PID) IN (
SELECT DISTINCT TRIM(PID) FROM M_Cast WHERE TRIM(MID) IN ( 
SELECT DISTINCT TRIM(MID) FROM M_Cast WHERE TRIM(PID) = (
SELECT TRIM(PID) FROM Person WHERE Name LIKE '%Shah Rukh Khan%')))) 
EXCEPT 
SELECT DISTINCT TRIM(PID) FROM M_Cast WHERE TRIM(MID) IN ( 
SELECT DISTINCT TRIM(MID) FROM M_Cast WHERE TRIM(PID) = (
SELECT TRIM(PID) FROM Person WHERE Name LIKE '%Shah Rukh Khan%')) )
"""
for row in cursor.execute(sql_query10):
    print(row)